import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-our-vision',
  templateUrl: './our-vision.component.html',
  styleUrls: ['./our-vision.component.scss']
})
export class OurVisionComponent implements OnInit {

  constructor() { }

  visions:any = [
    {title: 'مهمتنا', content: ' تقديم أفضل خدمات رعايه طبيه منزليه متكامله و آمنه للحصول علي صحه أفضل لمجتمعنا ، مع الأخذ في الأعتبار القوي الكوادر المختاره لتقديم الخدمات من أطباء وأخصائي التمريض ومساعديهم وأتخاذ كافه الاجراءات لتحقيق أعلي قدر من الآمان والسرعه في تقديم الخدمات و الالتزام بكافه معايير الصحه والآمان و أحترام خصوصيه كافي المرضي و الحرص علي تقديم الخدمه علي أعلي مستوي'},
    {title: 'خطتنا', content: 'الوصول بمؤسستنا الي كافه انحاء الجمهوريه والشرق الأوسط والتعاون الدائم مع المؤسسات مقدمي الخدمات الطبيه لتحقيق أعلي قدر من الحفاظ علي الصحه العامه للمجتمع'},
    {title: 'رؤيتنا', content: 'تقديم الخدمات الطبيه بشكل أسرع وأسهل لكل عملائنا وانتشار خدمات الرعايه الطبيه المنزليه لتحقيق أعلي قدر من الآمان والراحه والذي سوف يؤثر بشكل قوي علي الصحه العامه للمجتمع معتمده علي فريق مكون من أفضل الأطباء وأخصائي التمريض من ذوي الخبرات العاليه والمدربين جيداً علي تقديم الخدمات بأعلي مستوي ممكن من الدقه والأمان '}
  ]
  ngOnInit(): void {
  }

}
